{
  "posts": [
    {
      "title": "Forever Alone",
      "body": "Today, my sad ass got walked in on by a relative while I was having an imaginary conversation, with an imaginary friend, and I was talking out loud.",
      "author": "grangerrr",
      "id": 1
    },
    {
      "title": "Life is Pain",
      "body": "Today, since my family and friends always make fun of me for being a wuss when it comes to pain, when I stubbed my toe, I made a point to not scream or complain in any way. Instead, I vomited and fainted.",
      "author": "secretdragon818",
      "id": 2
    },
    {
      "title": "Gas Giant",
      "body": "Today, I learned that the average human farts 15 times a day. I fart more than that within the first hour of the day, and thats even after not eating anything for three days.",
      "author": "blogman77",
      "id": 3
    },
    {
      "title": "Off The Clock, Off The Record",
      "body": "Today, I was talking to a worker in Asda when an alarm went off on her watch and she took her vest off. Apparently, the alarm was the end of her shift, and removing the vest was so she could call me \"a time-wasting tit\" in a manner so I couldn’t report to her boss, since she was now on her own time.",
      "author": "Crazycatlady532",
      "id": 4
    },
    {
      "title": "Rejection Hotline",
      "body": "Today, after having my car's oil changed, I asked the girl at the front desk for her number and she gave it to me, so I was excited all day. That night I texted her and she asked who it was and I told her my name, then she told me she gave her number out to a lot of customers, so she didn’t remember me.",
      "author": "dragonlord__Xx",
      "id": 5
    },
    {
      "title": "Evil Stepmom",
      "body": "Today, my psycho stepmother and I got into an argument, and she started to get physical. After calling the police, and a cop showing up at the door, he took her side because she said it was \"discipline\". I'm a 29 year-old man.",
      "author": "elbarto",
      "id": 6
    },
    {
      "title": "Great Prank Dear",
      "body": "Today, my Xbox blew up. Apparently my wife thought a good prank was to Sellotape the fan holes, because a YouTuber told her it makes Xboxes crash repeatedly. Well, it didn’t crash, it melted some of the casing, caught fire, which also set fire to the bookcase it sits on, the wall, and our 50 inch TV.",
      "author": "Grayszzy",
      "id": 7
    }
  ]
}